<?php

namespace Database\Factories;

use Illuminate\Database\Eloquent\Factories\Factory;
use App\Models\Brand;

class BrandFactory extends Factory
{
    /**
     * The name of the factory's corresponding model.
     *
     * @var string
     */
    protected $model = Brand::class;

    /**
     * Define the model's default state.
     *
     * @return array
     */
    public function definition()
    {
        // قائمة بأسماء أقسام المتجر بالعربية
        $brands = [
            'سامسونج',
            'آبل',
            'سوني',
            'هواوي',
            'شياومي',
            'ديل',
            'إتش بي',
            'لينوفو',
            'إل جي',
            'بي إم دبليو',
            'مرسيدس',
            'تويوتا',
            'نيسان',
            'أديداس',
            'نايكي',
            'بوما',
            'ريبوك',
            'شانيل',
            'غوتشي',
            'ديور',
            'لوريال',
            'نيفيا',
            'مايكروسوفت',
            'غوغل',
            'أمازون',
            'علي بابا',
            'أوبو',
            'ريلمي',
            'فورد',
            'كيا',
            'هيونداي',
            'فيراري',
            'لامبورغيني',
            'ماكدونالدز',
            'ستاربكس',
            'كنتاكي',
            'بيبسي',
            'كوكاكولا',
            'ريد بول',
            'إيكيا',
            'زارا',
            'إتش آند إم',
            'نايك',
            'مايكروسوفت',
            'سيفورا',
            'باناسونيك',
            'فوجيتسو',
            'بوش',
            'كاتربيلر',
            'سيمنز',
            'فولكس فاجن',
            'أودي',
            'شيفروليه',
            'لينكولن',
            'روكسي',
            'ريبيرت',
            'فيرزاتشي',
            'برادا',
            'ريميل',
            'لانكوم',
            'ماكس فاكتور',
            'بوما',
            'كولجيت',
            'جيليت',
            'ستاربكس',
            'ليبتون',
            'نستله',
            'دانون',
            'كادبوري',
            'مارس',
        ];
        

        return [
            'name' => $this->faker->unique()->randomElement($brands),
        ];
    }
}
